turbinesFoam/validation/iea15mw/case/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// Generated by tools/generate_case.py. Do not edit by hand.

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0;
    }

    outlet
    {
        type inletOutlet;
        inletValue uniform 0;
        value uniform 0;
    }

    bottom
    {
        type symmetryPlane;
    }
    top
    {
        type symmetryPlane;
    }
    sideMinus
    {
        type symmetryPlane;
    }
    sidePlus
    {
        type symmetryPlane;
    }
}
