turbinesFoam/validation/iea15mw/case/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// Generated by tools/generate_case.py. Do not edit by hand.

turbine
{
    type axialFlowTurbineALSource;
    active on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames (U);
        selectionMode cellSet;
        cellSet turbine;
        origin (0 0 150);
        axis (-1 0 0);
        verticalDirection (0 0 1);
        freeStreamVelocity (10.659 0 0);
        tipSpeedRatio 8.9131856;
        rotorRadius 120.67532;
        azimuthalOffset 0;
        coneAngle 4;

        dynamicStall
        {
            active off;
            dynamicStallModel LeishmanBeddoes;
        }

        rotationalAugmentation
        {
            active off;
            model DuSelig;
            a 1;
            b 1;
            d 1;
        }

        endEffects
        {
            active off;
            endEffectsModel Glauert;
            GlauertCoeffs
            {
                tipEffects off;
                rootEffects off;
            }
        }

        blades
        {
            blade1
            {
                writePerf true;
                writeElementPerf true;
                elementType actuatorLineElement;
                nElements 147;
                elementProfiles
                (
                    polar_00 polar_01 polar_02 polar_03 polar_04 polar_05 polar_06 polar_07 polar_08 polar_09 polar_10 polar_11 polar_12 polar_13 polar_14 polar_15 polar_16 polar_17 polar_18 polar_19 polar_20 polar_21 polar_22 polar_23 polar_24 polar_25 polar_26 polar_27 polar_28 polar_29 polar_30 polar_31 polar_32 polar_33 polar_34 polar_35 polar_36 polar_37 polar_38 polar_39 polar_40 polar_41 polar_42 polar_43 polar_44 polar_45 polar_46 polar_47 polar_48 polar_49
                );
                elementData
                (
                    (0 3.97 0 5.2 0.5 -15.594553)
                    (0 6.35775371 0 5.20883994 0.499422309 -15.5877386)
                    (0 8.74550741 0 5.23788709 0.470536925 -15.4108347)
                    (0 11.1332611 0 5.29332531 0.441651542 -14.9485556)
                    (0 13.5210148 0 5.36733985 0.412766159 -14.2584548)
                    (0 15.9087685 0 5.45209268 0.383880775 -13.3971416)
                    (0 18.2965222 0 5.54003173 0.354995392 -12.4220195)
                    (0 20.6842759 0 5.62182426 0.326110008 -11.3945713)
                    (0 23.0720296 0 5.69253118 0.306800662 -10.3709761)
                    (0 25.4597833 0 5.74261089 0.292647741 -9.40399988)
                    (0 27.847537 0 5.76483683 0.27849482 -8.5515222)
                    (0 30.2352908 0 5.75611953 0.264341899 -7.83315304)
                    (0 32.6230445 0 5.70309851 0.250188978 -7.19135497)
                    (0 35.0107982 0 5.60467602 0.25 -6.55162906)
                    (0 37.3985519 0 5.47155913 0.25 -5.9339957)
                    (0 39.7863056 0 5.32277801 0.25 -5.34608961)
                    (0 42.1740593 0 5.16648229 0.25 -4.79633395)
                    (0 44.561813 0 5.01942133 0.25 -4.29659356)
                    (0 46.9495667 0 4.88580789 0.25 -3.8469552)
                    (0 49.3373204 0 4.76795968 0.25 -3.44534206)
                    (0 51.7250741 0 4.65456608 0.25 -3.07691391)
                    (0 54.1128278 0 4.54103105 0.25 -2.73356246)
                    (0 56.5005815 0 4.42817558 0.25 -2.41223467)
                    (0 58.8883352 0 4.31695888 0.25 -2.11169077)
                    (0 61.2760889 0 4.20788074 0.25 -1.82839646)
                    (0 63.6638426 0 4.10164619 0.25 -1.55878342)
                    (0 66.0515963 0 3.99871234 0.25 -1.30243687)
                    (0 68.43935 0 3.89940868 0.25 -1.06442737)
                    (0 70.8271037 0 3.80317254 0.25 -0.843446166)
                    (0 73.2148574 0 3.70938945 0.25 -0.636564187)
                    (0 75.6026111 0 3.61711174 0.25 -0.4370289)
                    (0 77.9903648 0 3.52563492 0.25 -0.239656793)
                    (0 80.3781185 0 3.43408267 0.25 -0.0396776882)
                    (0 82.7658723 0 3.34193311 0.25 0.172828124)
                    (0 85.153626 0 3.24867845 0.25 0.407083831)
                    (0 87.5413797 0 3.15610968 0.25 0.680377615)
                    (0 89.9291334 0 3.06458 0.25 0.99929361)
                    (0 92.3168871 0 2.97299265 0.25 1.32052526)
                    (0 94.7046408 0 2.88070511 0.25 1.62329876)
                    (0 97.0923945 0 2.78696938 0.25 1.88436815)
                    (0 99.4801482 0 2.69103094 0.25 2.08623009)
                    (0 101.867902 0 2.59196556 0.25 2.1639982)
                    (0 104.255656 0 2.48932365 0.25 2.17584117)
                    (0 106.643409 0 2.38391723 0.25 2.15530378)
                    (0 109.031163 0 2.27592382 0.25 2.10290952)
                    (0 111.418917 0 2.16546673 0.25 2.01840342)
                    (0 113.80667 0 2.05262508 0.25 1.89674321)
                    (0 116.194424 0 1.93775333 0.25 1.72432576)
                    (0 118.582178 0 1.81966297 0.25 1.50812511)
                    (0 120.969932 0 0.5 0.25 1.24238771)
                );
            }
            blade2
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 120;
            }
            blade3
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 240;
            }
        }

        hub
        {
            nElements 4;
            elementProfiles (cylinder);
            elementData
            (
                (0 3.97 7.94)
                (0 -3.97 7.94)
            );
        }

        profileData
        {
            polar_00
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_00.dat"
            }
            polar_01
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_01.dat"
            }
            polar_02
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_02.dat"
            }
            polar_03
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_03.dat"
            }
            polar_04
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_04.dat"
            }
            polar_05
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_05.dat"
            }
            polar_06
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_06.dat"
            }
            polar_07
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_07.dat"
            }
            polar_08
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_08.dat"
            }
            polar_09
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_09.dat"
            }
            polar_10
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_10.dat"
            }
            polar_11
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_11.dat"
            }
            polar_12
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_12.dat"
            }
            polar_13
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_13.dat"
            }
            polar_14
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_14.dat"
            }
            polar_15
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_15.dat"
            }
            polar_16
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_16.dat"
            }
            polar_17
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_17.dat"
            }
            polar_18
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_18.dat"
            }
            polar_19
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_19.dat"
            }
            polar_20
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_20.dat"
            }
            polar_21
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_21.dat"
            }
            polar_22
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_22.dat"
            }
            polar_23
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_23.dat"
            }
            polar_24
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_24.dat"
            }
            polar_25
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_25.dat"
            }
            polar_26
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_26.dat"
            }
            polar_27
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_27.dat"
            }
            polar_28
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_28.dat"
            }
            polar_29
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_29.dat"
            }
            polar_30
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_30.dat"
            }
            polar_31
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_31.dat"
            }
            polar_32
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_32.dat"
            }
            polar_33
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_33.dat"
            }
            polar_34
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_34.dat"
            }
            polar_35
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_35.dat"
            }
            polar_36
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_36.dat"
            }
            polar_37
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_37.dat"
            }
            polar_38
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_38.dat"
            }
            polar_39
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_39.dat"
            }
            polar_40
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_40.dat"
            }
            polar_41
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_41.dat"
            }
            polar_42
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_42.dat"
            }
            polar_43
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_43.dat"
            }
            polar_44
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_44.dat"
            }
            polar_45
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_45.dat"
            }
            polar_46
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_46.dat"
            }
            polar_47
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_47.dat"
            }
            polar_48
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_48.dat"
            }
            polar_49
            {
                GaussianCoeffs
                {
                    chordFactor 0.25;
                    dragFactor 1.0;
                    meshFactor 1;
                }
                #include "../../data/polars/polar_49.dat"
            }
            cylinder { data ((-180 0 1.1 0) (180 0 1.1 0)); }
        }
    }
}
