turbinesFoam/validation/iea15mw/case/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.com                      |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// Generated by tools/generate_case.py. Do not edit by hand.

actions
(
    {
        name turbine;
        type cellSet;
        action new;
        source boxToCell;
        box (-120.675323 -241.350646 -91.3506463) (120.675323 241.350646 391.350646);
    }
);
